Core/src/InformationRegisters/ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов/ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов</name>
  <resources>
    <name>ТипПрограммногоМодуля</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПрограммногоМодуля</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ТипВладельца</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВладельца</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>DefinedType.БезопасныйРежим</types>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииАдминистрированияПрофилейБезопасности</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗамещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавляемыеРазрешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаляемыеРазрешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросАдминистрирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/РежимыПодключенияВнешнихМодулей/РежимыПодключенияВнешнихМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РежимыПодключенияВнешнихМодулей</name>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>DefinedType.БезопасныйРежим</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеПрограммногоМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипПрограммногоМодуля</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммногоМодуля</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если РаботаВБезопасномРежиме.УстановленБезопасныйРежим() Тогда
		
		ТекущийБезопасныйРежим = БезопасныйРежим();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			Если Запись.БезопасныйРежим <> ТекущийБезопасныйРежим Тогда
				
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ka='უსაფრთხო რეჟიმი %1 მიმდინარე %2-ისგან განსხვავდება';ru='Безопасный режим %1 отличается от текущего %2'"),
					Запись.БезопасныйРежим, ТекущийБезопасныйРежим);
				
			КонецЕсли;
			
			ПрограммныйМодуль = РаботаВБезопасномРежимеСлужебный.СсылкаИзРегистраРазрешений(
				Запись.ТипВладельца, Запись.ИдентификаторПрограммногоМодуля);
			
			Если ПрограммныйМодуль <> Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка() Тогда
				
				БезопасныйРежимПрограммногоМодуля = РегистрыСведений.РежимыПодключенияВнешнихМодулей.РежимПодключенияВнешнегоМодуля(
					ПрограммныйМодуль);
				
				Если Запись.БезопасныйРежим <> БезопасныйРежимПрограммногоМодуля Тогда
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ka='პროგრამული მოდულ %1-ისთვის ნებართვების მოთხოვნა ვერ შესრულდება უსაფრთხო რეჟიმიდან %2';ru='Для программного модуля %1 не может быть выполнен запрос разрешений из безопасного режима %2'"),
						Строка(ПрограммныйМодуль), Запись.БезопасныйРежим);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
